<template>
  <Container>
    <template v-slot:content>
      <a-card >

        欢迎来到我们的网站，这是一个多元化、创新性十足的在线平台，致力于为用户提供丰富多彩的体验和服务。无论您是探索知识的学者、追逐时尚的潮人，还是寻找实用工具和资源的专业人士，我们都为您准备了精心策划的内容。<br>

        在这里，您可以畅游于知识的海洋，探索各种独特而深入的专题，从科学技术到人文艺术，我们为您呈现丰富的信息，助您不断拓展视野。同时，我们关注时事热点，为您提供最新的资讯，让您随时随地紧跟时代脉搏。<br>

        除了内容丰富的阅读体验，我们还提供便捷实用的工具和服务。无论您是寻找学术资源、技术支持，还是需要生活中的灵感和建议，我们都竭诚为您服务。交流合作更是我们倡导的理念，通过互动社区和专业平台，您可以与其他用户分享经验、结识志同道合的伙伴，共同促进共赢发展。<br>

        我们致力于打造一个开放、包容的网络家园，搭建起连接人与信息、人与人之间的桥梁。感谢您的光临，让我们一同探索、学习、成长，共同构建这个充满活力和创造力的网络社区。<br>

<br>
        <p>     欢迎来到我们的网站，这是一个多元化、创新性十足的在线平台，致力于为用户提供丰富多彩的体验和服务。无论您是探索知识的学者、追逐时尚的潮人，还是寻找实用工具和资源的专业人士，我们都为您准备了精心策划的内容。</p>

        在这里，您可以畅游于知识的海洋，探索各种独特而深入的专题，从科学技术到人文艺术，我们为您呈现丰富的信息，助您不断拓展视野。同时，我们关注时事热点，为您提供最新的资讯，让您随时随地紧跟时代脉搏。<br>

        除了内容丰富的阅读体验，我们还提供便捷实用的工具和服务。无论您是寻找学术资源、技术支持，还是需要生活中的灵感和建议，我们都竭诚为您服务。交流合作更是我们倡导的理念，通过互动社区和专业平台，您可以与其他用户分享经验、结识志同道合的伙伴，共同促进共赢发展。<br>

        我们致力于打造一个开放、包容的网络家园，搭建起连接人与信息、人与人之间的桥梁。感谢您的光临，让我们一同探索、学习、成长，共同构建这个充满活力和创造力的网络社区。<br>

<br>
        欢迎来到我们的网站，这是一个多元化、创新性十足的在线平台，致力于为用户提供丰富多彩的体验和服务。无论您是探索知识的学者、追逐时尚的潮人，还是寻找实用工具和资源的专业人士，我们都为您准备了精心策划的内容。<br>

        在这里，您可以畅游于知识的海洋，探索各种独特而深入的专题，从科学技术到人文艺术，我们为您呈现丰富的信息，助您不断拓展视野。同时，我们关注时事热点，为您提供最新的资讯，让您随时随地紧跟时代脉搏。<br>

        除了内容丰富的阅读体验，我们还提供便捷实用的工具和服务。无论您是寻找学术资源、技术支持，还是需要生活中的灵感和建议，我们都竭诚为您服务。交流合作更是我们倡导的理念，通过互动社区和专业平台，您可以与其他用户分享经验、结识志同道合的伙伴，共同促进共赢发展。<br>

        我们致力于打造一个开放、包容的网络家园，搭建起连接人与信息、人与人之间的桥梁。感谢您的光临，让我们一同探索、学习、成长，共同构建这个充满活力和创造力的网络社区。<br>
      </a-card>
    </template>
  </Container>
</template>

<script setup lang="ts">
import Container from "../components/Container.vue";
import {useUserInfoStore} from "../store/userInfo.ts";

const userinfoStore = useUserInfoStore()

function loginHandler() {
  const user = userinfoStore.user;
  console.log(user)
}


</script>

<style scoped>

</style>